In [7]:
import pandas as pd  
import seaborn as sns

In [3]:
df = pd.read_csv("Data/sample_submission.csv")
print(df.head(10))

       id  exam_score
0  630000           0
1  630001           0
2  630002           0
3  630003           0
4  630004           0
5  630005           0
6  630006           0
7  630007           0
8  630008           0
9  630009           0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270000 entries, 0 to 269999
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          270000 non-null  int64
 1   exam_score  270000 non-null  int64
dtypes: int64(2)
memory usage: 4.1 MB

In [8]:
sns.set(style="whitegrid")

In [6]:
df.isna().sum().sum()

0

In [9]:
import numpy as np
import matplotlib.pyplot as plt    
import seaborn as sns

In [10]:
df.dropna()

            id  exam_score
0       630000           0
1       630001           0
2       630002           0
3       630003           0
4       630004           0
...        ...         ...
269995  899995           0
269996  899996           0
269997  899997           0
269998  899998           0
269999  899999           0

[270000 rows x 2 columns]

In [11]:
df.duplicated().sum()

0

In [12]:
import warnings

warnings.filterwarnings("ignore")

In [13]:
df.describe()

                  id  exam_score
count  270000.000000    270000.0
mean   764999.500000         0.0
std     77942.430678         0.0
min    630000.000000         0.0
25%    697499.750000         0.0
50%    764999.500000         0.0
75%    832499.250000         0.0
max    899999.000000         0.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270000 entries, 0 to 269999
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          270000 non-null  int64
 1   exam_score  270000 non-null  int64
dtypes: int64(2)
memory usage: 4.1 MB